simpleFoam/simpleFoam_Basic/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // volHeatgen
    {
        name    volHeatgenCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.05 -0.05 -0.05) (0.05 0.05 0.05);
    }
    {
        name    volHeatgen;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     volHeatgenCellSet;
    }
);


// ************************************************************************* //
